import { of } from 'rxjs';

class FakeDataService {

    getData() {
        return of([
            {
                "id": 1,
                "title": "Недвижимость",
                "childs": [
                    {
                        "id": 101,
                        "title": "Квартиры",
                        "params": 1
                    },
                    {
                        "id": 102,
                        "title": "Комнаты",
                        "params": 1
                    },
                    {
                        "id": 103,
                        "title": "Дома, дачи, коттеджи",
                        "params": 1
                    },
                    {
                        "id": 104,
                        "title": "Земельные участки",
                        "params": 1
                    },
                    {
                        "id": 105,
                        "title": "Гаражи, парковки",
                        "params": 1
                    },
                    {
                        "id": 106,
                        "title": "Коммерческая недвижимость",
                        "params": 1
                    },
                    {
                        "id": 107,
                        "title": "Зарубежная недвижимость",
                        "params": 1
                    },
                    {
                        "id": 108,
                        "title": "Разное",
                        "params": 0
                    }
                ]
            },
            {
                "id": 2,
                "title": "Транспорт",
                "childs": [
                    {
                        "id": 201,
                        "title": "Автомобили с пробегом",
                        "params": 1
                    },
                    {
                        "id": 202,
                        "title": "Новые автомобили",
                        "params": 0
                    },
                    {
                        "id": 203,
                        "title": "Грузовые, спецтехника",
                        "params": 1
                    },
                    {
                        "id": 204,
                        "title": "Мототехника",
                        "params": 1
                    },
                    {
                        "id": 205,
                        "title": "Велотехника",
                        "params": 1
                    },
                    {
                        "id": 206,
                        "title": "Водный транспорт",
                        "params": 1
                    },
                    {
                        "id": 207,
                        "title": "Воздушный транспорт",
                        "params": 1
                    },
                    {
                        "id": 208,
                        "title": "Запчасти и аксессуары",
                        "params": 0
                    },
                    {
                        "id": 209,
                        "title": "Автосервисы",
                        "params": 0
                    },
                    {
                        "id": 210,
                        "title": "Разное",
                        "params": 0
                    }
                ]
            },
            {
                "id": 3,
                "title": "Техника и электроника",
                "childs": [
                    {
                        "id": 301,
                        "title": "Бытовая техника",
                        "params": 0
                    },
                    {
                        "id": 302,
                        "title": "Аудио и видео",
                        "params": 0
                    },
                    {
                        "id": 303,
                        "title": "Компьютерная техника",
                        "params": 0
                    },
                    {
                        "id": 304,
                        "title": "Телефоны",
                        "params": 0
                    },
                    {
                        "id": 305,
                        "title": "Фототехника",
                        "params": 0
                    },
                    {
                        "id": 306,
                        "title": "Игры, приставки и программы",
                        "params": 0
                    },
                    {
                        "id": 307,
                        "title": "Оргтехника и расходники",
                        "params": 0
                    },
                    {
                        "id": 308,
                        "title": "Разное",
                        "params": 0
                    }
                ]
            },
            {
                "id": 4,
                "title": "Строительство",
                "childs": [
                    {
                        "id": 401,
                        "title": "Строительные материалы",
                        "params": 0
                    },
                    {
                        "id": 402,
                        "title": "Станки, оборудование, инструменты",
                        "params": 0
                    },
                    {
                        "id": 403,
                        "title": "Отделочные материалы",
                        "params": 0
                    },
                    {
                        "id": 404,
                        "title": "Изделия из металла",
                        "params": 0
                    },
                    {
                        "id": 405,
                        "title": "Окна, двери, балконы, перегородки",
                        "params": 0
                    },
                    {
                        "id": 406,
                        "title": "Электротехнические изделия",
                        "params": 0
                    },
                    {
                        "id": 407,
                        "title": "Сантехнические изделия",
                        "params": 0
                    },
                    {
                        "id": 408,
                        "title": "Ручной инструмент",
                        "params": 0
                    },
                    {
                        "id": 409,
                        "title": "Метизы, крепеж, фурнитура",
                        "params": 0
                    },
                    {
                        "id": 410,
                        "title": "Насосы, вентиляция, отопления",
                        "params": 0
                    },
                    {
                        "id": 411,
                        "title": "Срубы домов и бань",
                        "params": 0
                    },
                    {
                        "id": 412,
                        "title": "Разное",
                        "params": 0
                    }
                ]
            },
            {
                "id": 5,
                "title": "Для дома и быта",
                "childs": [
                    {
                        "id": 501,
                        "title": "Мебель",
                        "params": 0
                    },
                    {
                        "id": 502,
                        "title": "Интерьер",
                        "params": 0
                    },
                    {
                        "id": 503,
                        "title": "Посуда и товары для кухни",
                        "params": 0
                    },
                    {
                        "id": 504,
                        "title": "Бассейны",
                        "params": 0
                    },
                    {
                        "id": 505,
                        "title": "Картины",
                        "params": 0
                    },
                    {
                        "id": 506,
                        "title": "Разное",
                        "params": 0
                    }
                ]
            },
            {
                "id": 6,
                "title": "Животные и растения",
                "childs": [
                    {
                        "id": 611,
                        "title": "Потеряно, найдено",
                        "params": 0
                    },
                    {
                        "id": 610,
                        "title": "Отдам даром",
                        "params": 0
                    },
                    {
                        "id": 601,
                        "title": "Собаки",
                        "params": 0
                    },
                    {
                        "id": 602,
                        "title": "Кошки",
                        "params": 0
                    },
                    {
                        "id": 603,
                        "title": "Птицы",
                        "params": 0
                    },
                    {
                        "id": 604,
                        "title": "Другие животные",
                        "params": 0
                    },
                    {
                        "id": 605,
                        "title": "Товары для животных",
                        "params": 0
                    },
                    {
                        "id": 606,
                        "title": "Услуги для животных",
                        "params": 0
                    },
                    {
                        "id": 607,
                        "title": "Рыбы и аквариумы",
                        "params": 0
                    },
                    {
                        "id": 608,
                        "title": "Растения",
                        "params": 0
                    },
                    {
                        "id": 609,
                        "title": "Разное",
                        "params": 0
                    }
                ]
            },
            {
                "id": 7,
                "title": "Личные вещи",
                "childs": [
                    {
                        "id": 701,
                        "title": "Одежда, обувь",
                        "params": 0
                    },
                    {
                        "id": 702,
                        "title": "Товары для детей и игрушки",
                        "params": 0
                    },
                    {
                        "id": 703,
                        "title": "Часы и аксессуары",
                        "params": 0
                    },
                    {
                        "id": 705,
                        "title": "Красота и здоровье",
                        "params": 0
                    },
                    {
                        "id": 706,
                        "title": "Подарки и сувениры",
                        "params": 0
                    },
                    {
                        "id": 707,
                        "title": "Разное",
                        "params": 0
                    },
                    {
                        "id": 704,
                        "title": "Ювелирные изделия",
                        "params": 0
                    }
                ]
            },
            {
                "id": 8,
                "title": "Хобби и отдых",
                "childs": [
                    {
                        "id": 802,
                        "title": "Книги и журналы",
                        "params": 0
                    },
                    {
                        "id": 803,
                        "title": "Коллекционирование",
                        "params": 0
                    },
                    {
                        "id": 805,
                        "title": "Охота и рыбалка",
                        "params": 0
                    },
                    {
                        "id": 806,
                        "title": "Спорт и отдых",
                        "params": 0
                    },
                    {
                        "id": 807,
                        "title": "Знакомства",
                        "params": 0
                    },
                    {
                        "id": 808,
                        "title": "Разное",
                        "params": 0
                    },
                    {
                        "id": 801,
                        "title": "Билеты и путешествия",
                        "params": 0
                    },
                    {
                        "id": 804,
                        "title": "Музыкальные инструменты",
                        "params": 0
                    }
                ]
            },
            {
                "id": 9,
                "title": "Работа и бизнес",
                "childs": [
                    {
                        "id": 901,
                        "title": "Вакансии",
                        "params": 1
                    },
                    {
                        "id": 902,
                        "title": "Резюме",
                        "params": 0
                    },
                    {
                        "id": 903,
                        "title": "Образование",
                        "params": 0
                    },
                    {
                        "id": 906,
                        "title": "Проекты и идеи",
                        "params": 0
                    },
                    {
                        "id": 907,
                        "title": "Оборудование для бизнеса",
                        "params": 0
                    },
                    {
                        "id": 908,
                        "title": "Разное",
                        "params": 0
                    },
                    {
                        "id": 904,
                        "title": "Инвесторы",
                        "params": 0
                    },
                    {
                        "id": 905,
                        "title": "Партнерство, совместный бизнес",
                        "params": 0
                    }
                ]
            },
            {
                "id": 10,
                "title": "Услуги",
                "childs": [
                    {
                        "id": 1001,
                        "title": "Адвокат, юрист",
                        "params": 0
                    },
                    {
                        "id": 1002,
                        "title": "Интерьер и дизайн",
                        "params": 0
                    },
                    {
                        "id": 1004,
                        "title": "Интернет-услуги",
                        "params": 0
                    },
                    {
                        "id": 1005,
                        "title": "Ремонт",
                        "params": 0
                    },
                    {
                        "id": 1006,
                        "title": "Салоны красоты, парикмахерские",
                        "params": 0
                    },
                    {
                        "id": 1007,
                        "title": "Ателье",
                        "params": 0
                    },
                    {
                        "id": 1008,
                        "title": "Типографии",
                        "params": 0
                    },
                    {
                        "id": 1009,
                        "title": "Другие",
                        "params": 0
                    },
                    {
                        "id": 1003,
                        "title": "Организация праздников",
                        "params": 0
                    }
                ]
            }
        ])
    }

}

export default new FakeDataService();
